---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewCoordAxisMode
source: html/29997de3-f673-afb2-e0fa-7a3787329c7f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewCoordAxisMode Property

"Show a Coordinate System Symbol for each Surface"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewCoordAxisMode { get; }
```